package com.project.liar;

import org.junit.jupiter.api.Test;
import org.springframework.beans.factory.annotation.Autowired;
import org.springframework.boot.test.context.SpringBootTest;

import com.project.liar.entity.Acticle;
import com.project.liar.repository.ActicleRepository;

@SpringBootTest
class LiarApplicationTests {
	@Autowired
	ActicleRepository acticleRepository;

	@Test
	void contextLoads() {
		String[] names = { "사자", "호랑이", "코끼리", "기린", "곰",
				"판다", "캥거루", "원숭이", "독수리", "상어",
				"늑대", "펭귄", "코알라", "돌고래", "악어",
				"올빼미", "다람쥐", "고양이", "개", "여우",
				"알파카", "코뿔소", "기니피그", "앵무새", "치타",
				"바다거북", "수달", "여우원숭이", "해파리", "책상",
				"게시판", "컴퓨터", "의자", "창문", "시계",
				"냉장고", "전화기", "책", "커피 머신", "모니터",
				"노트북", "전자레인지", "키보드", "전등", "탁자",
				"소파", "선풍기", "가위", "공책", "펜",
				"전기 주전자", "청소기", "카메라", "장식품", "망원경",
				"볼펜", "연필", "화이트보드", "축구",
				"야구", "농구", "테니스", "골프", "수영",
				"배구", "럭비", "크리켓", "핸드볼", "하키",
				"피구", "승마", "레슬링", "배드민턴", "스쿼시",
				"복싱", "체조", "카누", "사격", "탁구",
				"양궁", "철인 3종 경기", "줄넘기", "볼링", "스키",
				"스노우보드", "사이클링", "피자", "스파게티", "햄버거",
				"샐러드", "초밥", "치킨", "김밥", "라면",
				"초콜릿", "아이스크림", "스테이크", "파스타",
				"자전거", "자동차", "버스", "전철", "택시",
				"비행기", "배", "오토바이", "헬리콥터", "전투기",
				"기차", "킥보드", "보트", "트럭", "바이크",
				"장미", "튤립", "수선화", "해바라기", "벚꽃",
				"라벤더", "코스모스", "민들레", "라일락", "단풍나무",
				"오리엔탈 리리", "개나리", "무궁화", "페퍼민트",
				"사과", "바나나", "딸기", "포도", "수박",
				"체리", "키위", "배", "망고", "복숭아",
				"파인애플", "자몽", "오렌지", "레몬",
				"한국", "미국", "일본", "중국", "영국",
				"프랑스", "이탈리아", "독일", "스페인", "브라질",
				"캐나다", "호주", "인도", "러시아", "멕시코",
				"인셉션", "어벤져스", "타이타닉", "인터스텔라", "어바웃 타임",
				"라라랜드", "광해", "신세계", "알라딘", "터미네이터",
				"해리 포터", "그래비티", "위플래쉬", "스파이더맨", "다크 나이트",
				"라이언 일병 구하기", "쇼생크 탈출", "포레스트 검프", "베놈", "죽은 시인의 사회",
				"이병헌", "송강호", "전지현", "김수현", "하지원",
				"손예진", "조인성", "이정재", "한지민", "현빈",
				"김래원", "공효진", "고윤정", "공유", "하정우",
				"전지현", "박서준", "김윤석", "조정석", "박보영",
				"태양의 후예", "도깨비", "미스터 션샤인", "응답하라 1988", "또 오해영",
				"비밀의 숲", "스카이 캐슬", "보좌관", "동백꽃 필 무렵", "제빵왕 김탁구",
				"이태원 클라스", "선덕여왕", "놈놈놈", "연개소문", "대장금",
				"삼시세끼", "낭만닥터 김사부", "꽃보다 남자", "뿌리깊은나무", "나의 아저씨",
				"트와이스", "블랙핑크", "레드벨벳", "마마무", "에이프릴",
				"오마이걸", "러블리즈", "여자친구", "우주소녀", "모모랜드",
				"아이들", "드림캐쳐", "에버글로우", "있지", "위키미키",
				"방탄소년단", "엑소", "빅뱅", "워너원", "세븐틴",
				"갓세븐", "뉴이스트", "아스트로", "비투비", "투모로우바이투게더",
				"스트레이 키즈", "에이티즈", "원어스", "몬스타엑스", "빅스",
				"의사", "변호사", "교수", "경찰관", "소방관",
				"간호사", "선생님", "회계사", "엔지니어", "디자이너",
				"작가", "연예인", "요리사", "건축가", "항공기 조종사",
				"바리스타", "농부", "목수", "경영자", "바이올리니스트",
				"댄서", "배우", "음악가", "정치인", "철학자",
				"과학자", "기자", "환경운동가", "사회복지사", "파일럿",
				"모델", "청소부", "역사학자", "프로그래머", "법조인",
				"경매인", "의료기사", "웹디자이너", "화가", "심리상담사",
				"Nike", "Adidas", "Apple", "Samsung", "LG",
				"Gucci", "Louis Vuitton", "Chanel", "Rolex", "Mercedes-Benz",
				"Toyota", "BMW", "Porsche", "Cartier", "Hermès",
				"Prada", "Ferrari", "Lamborghini", "Dior", "Burberry",
				"Versace", "Givenchy", "Calvin Klein", "Hugo Boss", "Balenciaga",
				"Tiffany & Co.", "Ralph Lauren", "Lacoste", "Zara", "H&M" };

		for (String name : names) {
			Acticle acticle = new Acticle();
			acticle.setKind(name);
			acticleRepository.save(acticle);
		}

	}

}
